2021-03-22-ropemporium-ret2win.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-03-24 Thu 20:35 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>ROPemporium | ret2win</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="static/style.css" />
</head>
<body>
<div id="preamble" class="status">
<div class="header">
    <a href="index.html">Home</a>
    <a href="https://github.com/c3lphie">Github</a>
</div>
</div>
<div id="content">
<header>
<h1 class="title">ROPemporium | ret2win</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4264c28">1. Introduction</a>
<ul>
<li><a href="#org377adee">1.1. Buffer overflows</a></li>
<li><a href="#org2536e2b">1.2. Return Oriented Programming</a></li>
</ul>
</li>
<li><a href="#org54faab2">2. Recon</a>
<ul>
<li><a href="#orgcd95e17">2.1. File</a></li>
<li><a href="#org0390491">2.2. Checksec</a></li>
<li><a href="#org92e710a">2.3. Reversing the binary</a>
<ul>
<li><a href="#org0a16da9">2.3.1. Main function</a></li>
<li><a href="#orgfbd1dd0">2.3.2. pwnme function</a></li>
<li><a href="#orgfabcd2a">2.3.3. ret2win function</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0a675f9">3. Exploit</a>
<ul>
<li><a href="#org6da0245">3.1. Overflowing the buffer</a>
<ul>
<li><a href="#org5017396">3.1.1. Cyclic patterns</a></li>
</ul>
</li>
<li><a href="#org27a1a57">3.2. Useful addresses</a></li>
<li><a href="#org9f7b6dd">3.3. Final exploit</a></li>
</ul>
</li>
<li><a href="#org96231b8">4. Conclusion</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org4264c28" class="outline-2">
<h2 id="org4264c28"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Welcome to this little write-up on the very first challenge from <a href="https://ropemporium.com">ROPemporium</a>.<br>
</p>

<p>
ROPemporium is a platform for learning the mystic art of return-oriented programming(ROP).<br>
This is accomplished by going through 8 challenges in total, with increasing diffyculty.<br>
</p>

<p>
But before we begin this little eight-part adventure, let's take a closer look at what ROP is for a thing.<br>
</p>
</div>

<div id="outline-container-org377adee" class="outline-3">
<h3 id="org377adee"><span class="section-number-3">1.1</span> Buffer overflows</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I know that I just said i would explain ROP, but before we get into that.<br>
Let us quickly brushup on what a buffer overflow is.<br>
</p>

<p>
According to the very first paragraph on <a href="https://en.wikipedia.org/wiki/Buffer_overflow">wikipedia</a>:<br>
</p>
<blockquote>
<p>
In information security and programming, a buffer overflow, or buffer overrun, is an anomaly where a program, while writing data to a buffer, overruns the buffer's boundary and overwrites adjacent memory locations.<br>
</p>
</blockquote>

<p>
So buffer overflows happens when it is possible to put more data into a variable thereby overwriting other memory adresses.<br>
</p>

<p>
But why is this dangerous??<br>
</p>

<p>
Because we can manipulate the content in the different registers.<br>
And through this execute abitriary code.<br>
</p>

<p>
Again this was a veeeery short overview, if you want to read more about buffer overflows, and I recommend that you do, here is a list of resources on the subject:<br>
</p>
<dl class="org-dl">
<dt><a href="https://blog.rapid7.com/2019/02/19/stack-based-buffer-overflow-attacks-what-you-need-to-know/">Rapid7 - Stack-Based</a></dt><dd>Explained with Examples<br></dd>
<dt><a href="https://0xrick.github.io/">0xrick</a></dt><dd>Look at his basic binary series<br></dd>
<dt><a href="https://github.com/Tzaoh/pwning">Tzaoh's pwning list</a></dt><dd>Huge list of resources on all kinds of exploitation<br></dd>
<dt><a href="https://pwn.college/">pwn.college</a></dt><dd>A free and opensource exploitation course<br></dd>
</dl>

<p>
Eventually I'll create a series focused just on buffer overflows, but for now you'll have to make do.<br>
</p>
</div>
</div>

<div id="outline-container-org2536e2b" class="outline-3">
<h3 id="org2536e2b"><span class="section-number-3">1.2</span> Return Oriented Programming</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Again we look towards Wikipedia for more knowledge.<br>
The first paragraph on <a href="https://en.wikipedia.org/wiki/Return-oriented_programming">Wikipedia</a>:<br>
</p>
<blockquote>
<p>
Return-oriented programming (ROP) is a computer security exploit technique that allows an attacker to execute code in the presence of security defenses such as executable space protection and code signing.<br>
</p>
</blockquote>

<p>
The basic principle for ROP is that we can control which function we return to when we land on a <code>ret</code> instruction.<br>
There is also the topic of gadgets, but I'll explain that in the <code>split</code> write-up.<br>
</p>

<p>
But how does one control which the software will return to?<br>
</p>

<p>
That is exactly what this challenge is about.<br>
</p>
</div>
</div>
</div>

<div id="outline-container-org54faab2" class="outline-2">
<h2 id="org54faab2"><span class="section-number-2">2</span> Recon</h2>
<div class="outline-text-2" id="text-2">
<p>
Before anything is done you should always to some reconnaissance on your target.<br>
The more you know about the target, the easier it will be to model an attack towards it.<br>
</p>
</div>
<div id="outline-container-orgcd95e17" class="outline-3">
<h3 id="orgcd95e17"><span class="section-number-3">2.1</span> File</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The first thing you should do with any compiled binary that you want to pwn(professionel language for defeating security), is to run the <code>file</code> command on the the binary.<br>
</p>
<pre class="example" id="org68108f0">
┌────[~/ha/bi/ropemporium/ret2win on  master [?]
└─&gt;file ret2win
ret2win: ELF 64-bit LSB executable, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/ld-linux-x86-64.so.2, for GNU/Linux 3.2.0, BuildID[sha1]=19abc0b3bb228157af55b8e16af7316d54ab0597, not stripped
</pre>
<p>
What this tells us is that the binary <code>ret2win</code> is a 64-bit ELF file.<br>
</p>

<p>
It is not stripped, which means that if there is any debugging information in the code, we should be able to see it.<br>
It also means symbols are left in so we can see function names.<br>
</p>
</div>
</div>

<div id="outline-container-org0390491" class="outline-3">
<h3 id="org0390491"><span class="section-number-3">2.2</span> Checksec</h3>
<div class="outline-text-3" id="text-2-2">
<p>
After looking at what <code>file</code> gives outputs, the next nifty tool we should use is: <code>checksec</code>.<br>
It is a part of <code>pwntools</code>, <a href="https://github.com/Gallopsled/pwntools">a CTF framework and exploit development library</a>, and can tell us about what kind of security measures that the binary is compiled with.<br>
</p>
<pre class="example" id="org3a88ddd">
┌────[~/ha/bi/ropemporium/ret2win on  master [?]
└─&gt;checksec ret2win
[*] '/home/c3lphie/hacking/binary_exploitation/ropemporium/ret2win/ret2win'
    Arch:     amd64-64-little
    RELRO:    Partial RELRO
    Stack:    No canary found
    NX:       NX enabled
    PIE:      No PIE (0x400000)
</pre>
<p>
Here we see that there is basically no security measures put in place&#x2026; Which one would expect on the very first challenge.<br>
But what is it that we see here?<br>
</p>

<dl class="org-dl">
<dt>Arch</dt><dd>This is the Architecture for which the binary was compiled for. In this case we see that it is <code>amd64-64-little</code> I'll break this down further in a minute.<br></dd>
<dt>RELRO</dt><dd>A security measure which makes some binary sections read-only. Partial RELRO means basically nothing for us. Full RELRO is a lot more secure, but I'll tackle this when I encounter it.<br></dd>
<dt>Stack</dt><dd>This tells us if there are any canaries compiled into the binary. Canaries are a security measure that protect from stack smashing attacks&#x2026; Like what we're doing here. Not that they can't be handled<br></dd>
<dt>NX</dt><dd>A technology which splits the areas of memory up so that data can't be executed. This is the security measure we bypass using ROP<br></dd>
<dt>PIE</dt><dd>If this was enabled, the binary would have been loaded randomly into memory making it harder to exploit. But this is not something we need to worry about.<br></dd>
</dl>

<p>
The architecture this binary was compiled for was <code>amd64-64-little</code>, let's split this up into two.<br>
<code>amd64-64</code> means that it's for a 64 bit system.<br>
<code>-little</code> tells us that is for a little endian system.<br>
Which you can read more about <a href="https://www.section.io/engineering-education/what-is-little-endian-and-big-endian/">here</a>.<br>
</p>
</div>
</div>

<div id="outline-container-org92e710a" class="outline-3">
<h3 id="org92e710a"><span class="section-number-3">2.3</span> Reversing the binary</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Now there are probably a ton of other tools that you could use to find other things about the binary.<br>
But at this point I know enough about the target for now.<br>
</p>

<p>
I have chosen <a href="https://binary.ninja/">Binary ninja</a> for reverse engineering software.<br>
But use what-ever you're most comfortable in, and if you don't have the economy to buy a piece of software, then there are opensource software available like <a href="https://cutter.re/">cutter</a> or <a href="https://ghidra-sre.org/">ghidra</a>(if you're not afraid of the NSA ;)).<br>
</p>
</div>
