2021-03-22-ropemporium-ret2win.html
<div id="outline-container-org0a16da9" class="outline-4">
<h4 id="org0a16da9"><span class="section-number-4">2.3.1</span> Main function</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>main function disassembled</label><pre class="src src-asm">push    rbp {__saved_rbp}
mov     rbp, rsp {__saved_rbp}
mov     rax, qword [rel stdout]
mov     ecx, 0x0
mov     edx, 0x2
mov     esi, 0x0
mov     rdi, rax
call    setvbuf
mov     edi, 0x400808  {"ret2win by ROP Emporium"}
call    puts
mov     edi, 0x400820  {"x86_64\n"}
call    puts
mov     eax, 0x0
call    pwnme
mov     edi, 0x400828  {"\nExiting"}
call    puts
mov     eax, 0x0
pop     rbp {__saved_rbp}
retn     {__return_addr}
</pre>
</div>
<p>
Here we see the main function disassembled, there isn't anything interesting to see.<br>
What we want is the function pwnme, which is called on line 14.<br>
So let's take a look at that instead shall we?<br>
</p>
</div>
</div>
<div id="outline-container-orgfbd1dd0" class="outline-4">
<h4 id="orgfbd1dd0"><span class="section-number-4">2.3.2</span> pwnme function</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>pwnme function disassembled</label><pre class="src src-asm">push    rbp {__saved_rbp}
mov     rbp, rsp {__saved_rbp}
sub     rsp, 0x20
lea     rax, [rbp-0x20 {var_28}]
mov     edx, 0x20
mov     esi, 0x0
mov     rdi, rax {var_28}
call    memset
mov     edi, 0x400838  {"For my first trick, I will attem…"}
call    puts
mov     edi, 0x400898  {"What could possibly go wrong?"}
call    puts
mov     edi, 0x4008b8  {"You there, may I have your input…"}
call    puts
mov     edi, 0x400918
mov     eax, 0x0
call    printf
lea     rax, [rbp-0x20 {var_28}]
mov     edx, 0x38
mov     rsi, rax {var_28}
mov     edi, 0x0
call    read
mov     edi, 0x40091b  {"Thank you!"}
call    puts
nop     
leave    {__saved_rbp}
retn     {__return_addr}
</pre>
</div>

<p>
Since this is the function, which should be pwned, lets take a closer look using binary ninjas HLIL.<br>
I know I shouldn't rely on it, but I'm still learning so yeah.<br>
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>pwnme function HLIL</label><pre class="src src-c">void var_28
memset(&amp;var_28, 0, 0x20)
puts(str: "For my first trick, I will attem…")
puts(str: "What could possibly go wrong?")
puts(str: "You there, may I have your input…")
printf(format: data_400918)
read(fd: 0, buf: &amp;var_28, nbytes: 0x38)
return puts(str: "Thank you!")
</pre>
</div>

<p>
Let's clean it up a bit for easier understanding:<br>
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>pwnme function HLIL with var names</label><pre class="src src-c">void buffer
memset(&amp;buffer, 0, 32)
puts(str: "For my first trick, I will attem…")
puts(str: "What could possibly go wrong?")
puts(str: "You there, may I have your input…")
printf(format: data_400918)
read(fd: 0, buf: &amp;buffer, nbytes: 56)
return puts(str: "Thank you!")
</pre>
</div>

<p>
As we can see we have a buffer with the size 32 bytes, but the read call accepts up to 56 bytes.<br>
This means that we can overflow the buffer and control the stack.<br>
But how should we control the stack?<br>
</p>

<p>
Well if you look at the last two lines of the disassembly version of <code>pwnme</code><br>
</p>
<div class="org-src-container">
<pre class="src src-asm">leave    {__saved_rbp}
retn     {__return_addr}
</pre>
</div>
<p>
If we somehow managed to overwrite <code>__return_addr</code> we potentially have the ability to make arbitrary code calls.<br>
</p>
</div>
</div>

<div id="outline-container-orgfabcd2a" class="outline-4">
<h4 id="orgfabcd2a"><span class="section-number-4">2.3.3</span> ret2win function</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>ret2win function disassembled</label><pre class="src src-asm">push    rbp {__saved_rbp}
mov     rbp, rsp {__saved_rbp}
mov     edi, 0x400926  {"Well done! Here's your flag:"}
call    puts
mov     edi, 0x400943  {"/bin/cat flag.txt"}
call    system
nop     
pop     rbp {__saved_rbp}
retn     {__return_addr}
</pre>
</div>
<p>
This is the function we must aim the <code>ret</code> instruction towards in the <code>pwnme</code> function<br>
</p>

<p>
And as we can see it just executes <code>/bin/cat flag.txt</code> on the system.<br>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org0a675f9" class="outline-2">
<h2 id="org0a675f9"><span class="section-number-2">3</span> Exploit</h2>
<div class="outline-text-2" id="text-3">
<p>
When writing the actual exploit I used 3 tools: <code>emacs</code>, a <code>terminal</code> and <code>gdb</code>.<br>
The first one being my text editor ;), the second is pretty self explanatory and the last is Gnu Debugger.<br>
</p>
</div>
