2021-03-22-ropemporium-ret2win.html

<div id="outline-container-org6da0245" class="outline-3">
<h3 id="org6da0245"><span class="section-number-3">3.1</span> Overflowing the buffer</h3>
<div class="outline-text-3" id="text-3-1">
<p>
As I wrote earlier we need to do a bufferoverflow.<br>
We know that from Binary Ninja that we have an input buffer that is 32 bytes long.<br>
But the <code>read</code> function can read up to 56 bytes into the buffer.<br>
</p>

<p>
So lets see what happen if we put a bunch of data into the buffer!<br>
</p>
<pre class="example" id="org819dfc7">
┌────[~/ha/bi/ropemporium/ret2win on  master [?]
└─&gt;./ret2win
ret2win by ROP Emporium
x86_64

For my first trick, I will attempt to fit 56 bytes of user input into 32 bytes of stack buffer!
What could possibly go wrong?
You there, may I have your input please? And don't worry about null bytes, we're using read()!

&gt; AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
Thank you!
zsh: segmentation fault (core dumped)  ./ret2win
</pre>
<p>
And we crashed!<br>
But why?<br>
</p>

<p>
If we try again, but run <code>ret2win</code> with <code>gdb</code> attached we can see what happens to the registers.<br>
I have set a break point on the <code>leave</code> instruction just before the <code>ret</code> instruction.<br>
And a couple of instructions before the <code>read</code> call.<br>
</p>

<p>
If we look at the registers before <code>read</code>.<br>
</p>
<pre class="example" id="orgb7cf047">
[ Legend: Modified register | Code | Heap | Stack | String ]
────────────────────────────────────────────────────────────────────────────────────────── registers ────
$rax   : 0x2
$rbx   : 0x0000000000400780  →  &lt;__libc_csu_init+0&gt; push r15
$rcx   : 0x0
$rdx   : 0x0
$rsp   : 0x00007fffffffe040  →  0x0000000000000000
$rbp   : 0x00007fffffffe060  →  0x00007fffffffe070  →  0x0000000000000000
$rsi   : 0x00007fffffffbf20  →  0x000000000000203e ("&gt; "?)
$rdi   : 0x00007ffff7f8f4d0  →  0x0000000000000000
$rip   : 0x0000000000400733  →  &lt;pwnme+75&gt; lea rax, [rbp-0x20]
$r8    : 0x60
$r9    : 0x00007ffff7fdc070  →  &lt;_dl_fini+0&gt; endbr64
$r10   : 0x0000000000400918  →  0x6b6e61685400203e ("&gt; "?)
$r11   : 0x246
$r12   : 0x00000000004005b0  →  &lt;_start+0&gt; xor ebp, ebp
$r13   : 0x0
$r14   : 0x0
$r15   : 0x0
$eflags: [zero carry parity adjust sign trap INTERRUPT direction overflow resume virtualx86 identification]
$cs: 0x0033 $ss: 0x002b $ds: 0x0000 $es: 0x0000 $fs: 0x0000 $gs: 0x0000
</pre>
<p>
The two registers we are interested in are <code>$rsp</code> and <code>$rbp</code>.<br>
</p>

<p>
<code>$rsp</code> is the stack pointer, it points to addresses in the stack where the buffer is stored.<br>
<code>$rbp</code> is the base pointer, it points to the memory address which is the "base" for the function.<br>
When returning from a function, we will land where <code>$rbp</code> points to.<br>
</p>

<p>
So lets crash this program!<br>
</p>
<pre class="example" id="orgcb3a4ba">
gef➤  run
Starting program: /home/c3lphie/hacking/binary_exploitation/ropemporium/ret2win/ret2win
ret2win by ROP Emporium
x86_64

For my first trick, I will attempt to fit 56 bytes of user input into 32 bytes of stack buffer!
What could possibly go wrong?
You there, may I have your input please? And don't worry about null bytes, we're using read()!

&gt; AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
</pre>
<p>
Here I just run it in GDB, and wrote a bunch of A's before hitting enter.<br>
Don't mind the gef➤ prompt, that is just a gdb extension which makes exploit development easier.<br>
</p>

<p>
Below you can see the content of the registers after the crash.<br>
</p>
<pre class="example" id="org6ced04a">
[ Legend: Modified register | Code | Heap | Stack | String ]
────────────────────────────────────────────────────────────────────────────────────────── registers ────
$rax   : 0xb
$rbx   : 0x0000000000400780  →  &lt;__libc_csu_init+0&gt; push r15
$rcx   : 0x00007ffff7ebb0f7  →  0x5177fffff0003d48 ("H="?)
$rdx   : 0x0
$rsp   : 0x00007fffffffe040  →  "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA[...]"
$rbp   : 0x00007fffffffe060  →  0x4141414141414141 ("AAAAAAAA"?)
$rsi   : 0x00007ffff7f8d5a3  →  0xf8f4d0000000000a
$rdi   : 0x00007ffff7f8f4d0  →  0x0000000000000000
$rip   : 0x0000000000400754  →  &lt;pwnme+108&gt; leave
$r8    : 0xb
$r9    : 0x00007ffff7fdc070  →  &lt;_dl_fini+0&gt; endbr64
$r10   : 0xfffffffffffffb8b
$r11   : 0x246
$r12   : 0x00000000004005b0  →  &lt;_start+0&gt; xor ebp, ebp
$r13   : 0x0
$r14   : 0x0
$r15   : 0x0
$eflags: [ZERO carry PARITY adjust sign trap INTERRUPT direction overflow resume virtualx86 identification]
$cs: 0x0033 $ss: 0x002b $ds: 0x0000 $es: 0x0000 $fs: 0x0000 $gs: 0x0000
</pre>
<p>
The hexadecimal value for A is 0x41 when ascii encoded.<br>
And as you can see we managed to overwrite <code>$rbp</code>, so now we just need to control <code>$rbp</code> to point to the <code>ret2win</code> function.<br>
</p>

<p>
To do this we need to figure out how much data to insert before address.<br>
</p>
</div>
